//* 자바스크립트에서 truthy와 falsy한 값은 무엇인가요?
//* 각각 2개의 예를 들어보세요.

// ? 참 값은 값 truthy한 값

// * 숫자 : 0을 제외한 모든 숫자는 truthy한 값이다.
// * 문자열 : 빈 문자열을 제외한 모든 문자열은 truthy한 값이다.
// * boolean : true는 truthy한 값이다.
// * 객체 : 빈 객체를 제외한 모든 객체는 truthy한 값이다.
// * 함수 : 빈 함수를 제외한 모든 함수는 truthy한 값이다.
// * 배열 : 빈 배열을 제외한 모든 배열은 truthy한 값이다.
// * 날짜 : 빈 날짜를 제외한 모든 날짜는 truthy한 값이다.

// ! 거짓 같은 값 falsy한 값

// * 숫자 : 0은 falsy한 값이다.
// * 문자열 : 빈 문자열은 falsy한 값이다.
// * boolean : false는 falsy한 값이다.
// * 객체 : 빈 객체는 falsy한 값이다.
// * 함수 : 빈 함수는 falsy한 값이다.
// * 배열 : 빈 배열은 falsy한 값이다.
// * 날짜 : 빈 날짜는 falsy한 값이다.